In [4]:
import pandas as pd

In [16]:
df = pd.read_csv('C:/Users/Linda/JupyterProjects/data/D1.txt',sep='   ', header=None)

C:\Users\Linda\AppData\Local\Temp\ipykernel_15576\1278422723.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df = pd.read_csv('C:/Users/Linda/JupyterProjects/data/D1.txt',sep='   ', header=None)

In [17]:
df.head()

       0      1
0  18944  47230
1  94847  63037
2  93893  35622
3  37174  43365
4  77982  51397

In [18]:
df = df.set_axis(['list1', 'list2'], axis=1)

In [19]:
df.head()

   list1  list2
0  18944  47230
1  94847  63037
2  93893  35622
3  37174  43365
4  77982  51397

In [30]:
sorted_list1 = df.list1.sort_values(ascending=True).reset_index(drop=True)
sorted_list1

0      10178
1      10197
2      10212
3      10213
4      10242
       ...
995    99414
996    99586
997    99626
998    99730
999    99854
Name: list1, Length: 1000, dtype: int64

In [28]:
sorted_list2 = df.list2.sort_values(ascending=True).reset_index(drop=True)
sorted_list2

0      10024
1      10074
2      10212
3      10212
4      10212
       ...
995    98335
996    99080
997    99196
998    99806
999    99891
Name: list2, Length: 1000, dtype: int64

In [54]:
df2 = pd.DataFrame({'list1':sorted_list1,
                   'list2':sorted_list2})
df2.reset_index (drop=True)

     list1  list2
0    10178  10024
1    10197  10074
2    10212  10212
3    10213  10212
4    10242  10212
..     ...    ...
995  99414  98335
996  99586  99080
997  99626  99196
998  99730  99806
999  99854  99891

[1000 rows x 2 columns]

In [55]:
df2.head()

   list1  list2
0  10178  10024
1  10197  10074
2  10212  10212
3  10213  10212
4  10242  10212

In [58]:
df2['diff'] = abs(df2['list1'] - df2['list2'])

In [59]:
df2.head()

   list1  list2  diff
0  10178  10024   154
1  10197  10074   123
2  10212  10212     0
3  10213  10212     1
4  10242  10212    30

In [62]:
df2['diff'].sum()

1590491